app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'parinasdiana28@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Find the user by email [cite: 45, 47]
        $user = $model->where('email', $email)->first();

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Diana', 'parinasdiana28@gmail.com', '$2y$10$neBqwTON4hX/JQzSINHUSeSoYaRgWRfvMzxwx8veDy/7Ae.jBb6wS')
---
    public function register()
    {
        $userModel = new UserModel();

        $rules = [
            'name'     => 'required|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Save with BCrypt Hashing (Satisfies Security Requirements)
        $userModel->save([
            'name'     => $this->request->getPost('name'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
        ]);