app/Controllers/TaskWeb.php

SELECT *
FROM `tasks`
---
    public function index() {
        // Simple security check (Authorization)
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $model = new TaskModel();
        $data['tasks'] = $model->findAll();

INSERT INTO `tasks` (`title`, `status`) VALUES ('Advanced Web Development - Midterm Terminal Assessment', 'pending')
---
    public function create() {
        $model = new TaskModel();
        $model->save([
            'title'  => $this->request->getPost('title'),
            'status' => 'pending'
        ]);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '1'
UPDATE `tasks` SET `status` = 'pending'
WHERE `tasks`.`id` IN ('1')
---
    public function toggle($id) {
        $model = new TaskModel();
        $task = $model->find($id);
        $newStatus = ($task['status'] == 'pending') ? 'completed' : 'pending';
        $model->update($id, ['status' => $newStatus]);

DELETE FROM `tasks`
WHERE `id` IN ('1')
---
    public function delete($id) {
        $model = new TaskModel();
        $model->delete($id);